bezier_coanda_transient/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    down
    {
        type            patch;
        nFaces          25;
        startFace       28126;
    }
    right
    {
        type            patch;
        nFaces          60;
        startFace       28151;
    }
    up
    {
        type            patch;
        nFaces          25;
        startFace       28211;
    }
    meanFlow
    {
        type            patch;
        nFaces          240;
        startFace       28236;
    }
    coandaUpper
    {
        type            patch;
        nFaces          2;
        startFace       28476;
    }
    coandaLower
    {
        type            patch;
        nFaces          2;
        startFace       28478;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          354;
        startFace       28480;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          28480;
        startFace       28834;
    }
)

// ************************************************************************* //
