bezier_coanda_transient/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          298;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    meanFlow
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }

    coandaUpper
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }

    coandaLower
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           $inletValue;
    }

    down
    {
        type            zeroGradient;
    }

    up
    {
        type            zeroGradient;
    }

    right
    {
        type            zeroGradient;
    }



    surface
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}
